package com.dz;

public class Six {

    public static void main(String[] args) {

//        6. Создайте новый проект и подключите в него Git через терминал.
//        Укажите что в вашем проекте будут игнорироваться все файлы с расширением .txt,
//        а также папки: bin, admin, config.
//
//                Выполните следующее:
//        добавьте все файлы в локальное хранилище;
//        создайте новую ветку и перейдите в неё;
//        в новой ветке создайте папку blog с файлами: index.js, index.html;
//        загрузите на удаленный репозиторий лишь основную ветку вашего проекта.


    }

}
